nxp-mcuxpresso/mcuxsdk-examples/_boards/imx952evk/cmsis_driver_examples/lpspi/int_b2b_transfer/master/cm7/pin_mux.c
/*
 * Copyright 2023 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v12.0
processor: MIMX9352xxxxM
package_id: MIMX9352DVUXM
mcu_data: ksdk2_0
processor_version: 0.12.3
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO15__LPUART3_RX, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO14__LPUART3_TX, 0U);

    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO15__LPUART3_RX,
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO14__LPUART3_TX,
                        IOMUXC_PAD_DSE(15U));

    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO02__LPI2C6_SDA, 1U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO03__LPI2C6_SCL, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO02__LPI2C6_SDA, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO03__LPI2C6_SCL, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);

    BOARD_InitPins();
    LPSPI7_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33}
- pin_list:
  - {pin_num: F20, peripheral: LPUART2, signal: lpuart_rx, pin_signal: UART2_RXD, PD: ENABLED, FSEL1: SlOW_SLEW_RATE, DSE: NO_DRIVE}
  - {pin_num: F21, peripheral: LPUART2, signal: lpuart_tx, pin_signal: UART2_TXD, PD: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: D21, peripheral: LPI2C2, signal: lpi2c_sda, pin_signal: I2C2_SDA, SION: ENABLED, OD: ENABLED, PD: DISABLED}
  - {pin_num: D20, peripheral: LPI2C2, signal: lpi2c_scl, pin_signal: I2C2_SCL, SION: ENABLED, OD: ENABLED, PD: DISABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {                                /*!< Function assigned for the core: undefined[cm33] */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
LPSPI7_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33}
- pin_list:
  - {pin_num: M20, peripheral: LPSPI7, signal: 'lpspi_pcs, 0', pin_signal: GPIO_IO08}
  - {pin_num: N18, peripheral: LPSPI7, signal: lpspi_sck, pin_signal: GPIO_IO11}
  - {pin_num: M21, peripheral: LPSPI7, signal: lpspi_sin, pin_signal: GPIO_IO09}
  - {pin_num: N17, peripheral: LPSPI7, signal: lpspi_sout, pin_signal: GPIO_IO10}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPSPI7_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPSPI7_InitPins(void) {                               /*!< Function assigned for the core: undefined[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO04__LPSPI7_PCS0, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO05__LPSPI7_SIN, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO06__LPSPI7_SOUT, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO07__LPSPI7_SCK, 0U);

    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO04__LPSPI7_PCS0, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO05__LPSPI7_SIN, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO06__LPSPI7_SOUT, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO07__LPSPI7_SCK, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
LPSPI7_DeinitPins:
- options: {callFromInitBoot: 'false', coreID: cm33}
- pin_list:
  - {pin_num: M20, peripheral: GPIO2, signal: 'gpio_io, 08', pin_signal: GPIO_IO08}
  - {pin_num: M21, peripheral: GPIO2, signal: 'gpio_io, 09', pin_signal: GPIO_IO09}
  - {pin_num: N17, peripheral: GPIO2, signal: 'gpio_io, 10', pin_signal: GPIO_IO10}
  - {pin_num: N18, peripheral: GPIO2, signal: 'gpio_io, 11', pin_signal: GPIO_IO11}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPSPI7_DeinitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPSPI7_DeinitPins(void) {                             /*!< Function assigned for the core: undefined[cm33] */
    IOMUXC_SetPinMux( IOMUXC_PAD_GPIO_IO04__GPIO2_IO_4, 0U);
    IOMUXC_SetPinMux( IOMUXC_PAD_GPIO_IO05__GPIO2_IO_5, 0U);
    IOMUXC_SetPinMux( IOMUXC_PAD_GPIO_IO06__GPIO2_IO_6, 0U);
    IOMUXC_SetPinMux( IOMUXC_PAD_GPIO_IO07__GPIO2_IO_7, 0U);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
